microbuilder/LPC1343CodeBase/projectconfig.h
/**************************************************************************/
/*! 
    @file     projectconfig.h
    @author   K. Townsend (microBuilder.eu)

    @section LICENSE

    Software License Agreement (BSD License)

    Copyright (c) 2012, microBuilder SARL
    All rights reserved.

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
    1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holders nor the
    names of its contributors may be used to endorse or promote products
    derived from this software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ''AS IS'' AND ANY
    EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
    DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
/**************************************************************************/

#ifndef _PROJECTCONFIG_H_
#define _PROJECTCONFIG_H_

#include "lpc134x.h"
#include "sysdefs.h"

/*=========================================================================
    BOARD SELECTION

    Because several boards use this code library with sometimes slightly
    different pin configuration, you will need to specify which board you
    are using by enabling one of the following definitions. The code base
    will then try to configure itself accordingly for that board.

    CFG_BRD_LPC1343_REFDESIGN   
    =========================

        microBuilder.eu LPC1343 Reference Design base board with
        on-board peripherals initialised (EEPROM, USB or UART CLI, etc.)
		
		This is the recommended starting point for new development
		since it makes it easy to send printf output to USB CDC, access
		the on-board EEPROM, etc.

    CFG_BRD_LPC1343_REFDESIGN_MINIMAL
    =================================

        microBuilder.eu LPC1343 Reference Design base board with 
        only the most common peripherals initialised by default.  
        
        Results in smallest code since EEPROM, USB, etc., are not
        initialised on startup.  By default, only the following
        peripherals are initialised by systemInit():
        
              - CPU (Configures the PLL, etc.)
              - GPIO
              - SysTick Timer
              - UART (with printf support) *
    
        * Can be removed to save 0.8kb in debug and 0.3 kb in
        release. Comment out 'CFG_PRINTF_UART' to disable it.
  
        The code size can be further reduced by several KB by removing
        any IRQ Handlers that are not used.  The I2C IRQHandler, for
        example, uses ~1KB of flash in debug and ~400KB in release mode,
        but because it is referenced in the startup code it is always
        included even if I2C is never used in the project.

        Other IRQ Handlers that you might be able to comment out
        to save some space are:

        IRQ Handler               Debug   Release
        ------------------------- ------  -------
        I2C_IRQHandler            1160 b    400 b
        SSP_IRQHandler             160 b     76 b
        UART_IRQHandler            246 b    116 b
        WAKEUP_IRQHandler          160 b    100 b
        WDT_IRQHandler              50 b     28 b

    CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB
    ====================================

        microBuilder.eu/Adafruit Stand-Alone "Smart LCD" with USB enabled
        for the CLI interface.

    CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
    =====================================

        microBuilder.eu/Adafruit Stand-Alone "Smart LCD" with UART enabled
        for the CLI interface.

    CFG_BRD_LPC1343_802154USBSTICK
    ==============================

        microBuilder.eu USB stick 802.15.4 868/915MHz RF transceiver

    CFG_BRD_LPC1343_OLIMEX_P
    ==============================

        Simple Olimex LPC1343 breakout board

    CFG_BRD_LPC1343_LPCXPRESSO
    ==============================

        LPC1343 LPCXpresso board

    CFG_BRD_LPC1343_CATNIP
    ==============================

        LPC1343 CatNip board
 
 
    -----------------------------------------------------------------------*/
    // #define CFG_BRD_LPC1343_REFDESIGN
    // #define CFG_BRD_LPC1343_REFDESIGN_MINIMAL
    // #define CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB
    // #define CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
    // #define CFG_BRD_LPC1343_802154USBSTICK
    // #define CFG_BRD_LPC1343_OLIMEX_P
    // #define CFG_BRD_LPC1343_LPCXPRESSO
    #define CFG_BRD_LPC1343_CATNIP
/*=========================================================================*/


/**************************************************************************
    PIN USAGE
    -----------------------------------------------------------------------
    This table tries to give an indication of which GPIO pins and 
    peripherals are used by the available drivers and SW examples.  Only
    dedicated GPIO pins available on the LPC1343 Reference Board are shown
    below.  Any unused peripheral blocks like I2C, SSP, ADC, etc., can
    also be used as GPIO if they are available.

                PORT 1        PORT 2                PORT 3 
                =========     =================     =======
                8 9 10 11     1 2 3 4 5 6 7 8 9     0 1 2 3

    SDCARD      . .  .  .     . . . . . . . . .     X . . .
    PWM         . X  .  .     . . . . . . . . .     . . . .
    STEPPER     . .  .  .     . . . . . . . . .     X X X X
    CHIBI       X X  X  .     . . . . . . . . .     . . . .
    ILI9325/8   X X  X  X     X X X X X X X X X     . . . X
    ST7565      X X  X  X     X X X X X X X X X     . . . X
    ST7735      . .  .  .     X X X X X X . . .     . . . .
    SHARPMEM    . .  .  .     X X X X . . . . .     . . . .
    SSD1306 SPI . .  .  .     X X X . X X . . .     . . . .
    SSD1351     . .  .  .     X X X X X . . . .     . . . .
    MCP121      . .  .  .     . . . . . . . . .     . X . .
    PN532 [3]   . .  .  .     . . . . . . . . .     . X X . 

                TIMERS                    SSP     ADC         UART
                ======================    ===     =======     ====
                16B0  16B1  32B0  32B1    0       0 1 2 3     0

    SDCARD      .     .     .     .       X       . . . .     .
    PWM         .     X     .     .       .       . . . .     .
    PMU [1]     .     .     X     .       .       . . . .     .
    USB         .     .     .     X       .       . . . .     .
    STEPPER     .     .     X     .       .       . . . .     .
    CHIBI       x     .     .     .       X       . . . .     .
    ILI9325/8   .     .     .     .       .       X X X X     .
    ST7565      .     .     .     .       .       X X X X     .
    ST7535      .     .     .     .       .       . . . .     .
    SHARPMEM    .     .     .     .       .       . . . .     .
    SSD1306 SPI .     .     .     .       .       . . . .     .
    INTERFACE   .     .     .     .       .       . . . .     X[2]

    [1]  PMU uses 32-bit Timer 0 for SW wakeup from deep-sleep.  This timer
         can safely be used by other peripherals, but may need to be
         reconfigured when you wakeup from deep-sleep.
    [2]  INTERFACE can be configured to use either USBCDC or UART
    [3]  P3.2 is only used with the I2C bus (for IRQ)

 **************************************************************************/


/**************************************************************************
    I2C Addresses
    -----------------------------------------------------------------------
    The following addresses are used by the different I2C sensors included
    in the code base [1]

                                HEX       BINARY  
                                ====      ========
    ISL12022M (RTC)             0xDE      1101111x
    ISL12022M (SRAM)            0xAE      1010111x
    LM75B                       0x90      1001000x
    MCP24AA                     0xA0      1010000x
    MCP4725                     0xC0      1100000x ***
    TEA5767                     0xC0      1100000x ***
    TSL2561                     0x72      0111001x
    TCS3414                     0x72      0111001x
    PN532                       0x48      0100100x
    SSD1306_I2C                 0x78      0111100x  // Assumes SA0 = GND
    INA219                      0xF0      10000000x // Assumes A0+A1 = GND

