microbuilder/LPC1343CodeBase/projectconfig.h
    [1]  Alternative addresses may exists, but the addresses listed in this
         table are the values used in the code base

 **************************************************************************/


/*=========================================================================
    FIRMWARE VERSION SETTINGS
    -----------------------------------------------------------------------*/
    #define CFG_FIRMWARE_VERSION_MAJOR            (1)
    #define CFG_FIRMWARE_VERSION_MINOR            (1)
    #define CFG_FIRMWARE_VERSION_REVISION         (0)
/*=========================================================================*/


/*=========================================================================
    CORE CPU SETTINGS
    -----------------------------------------------------------------------

    CFG_CPU_CCLK    Value is for reference only.  'core/cpu/cpu.c' must
                    be modified to change the clock speed, but the value
                    should be indicated here since CFG_CPU_CCLK is used by
                    other peripherals to determine timing.

    -----------------------------------------------------------------------*/
    #define CFG_CPU_CCLK                (72000000)  // 1 tick = 13.88nS
/*=========================================================================*/


/*=========================================================================
    SYSTICK TIMER
    -----------------------------------------------------------------------

    CFG_SYSTICK_DELAY_IN_MS   The number of milliseconds between each tick
                              of the systick timer.

    -----------------------------------------------------------------------*/
    #define CFG_SYSTICK_DELAY_IN_MS     (1)
/*=========================================================================*/


/*=========================================================================
    GPIO INTERRUPTS
    -----------------------------------------------------------------------

    IF you wish to use the GPIO interrupt handlers elsewhere in your code,
    you should probably define a seperate IRQHandler for the appropriate
    GPIO bank rather than using the definitions in core/gpio/gpio.c (to
    avoid causing problems in other projects, and to make updates easier,
    etc.)  To disable the default IRQHandler, simply comment out the
    define below for the appropriate GPIO bank and implement the handler
    somewhere else.

    GPIO_ENABLE_IRQ0    If defined, PIOINT0_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ1    If defined, PIOINT1_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ2    If defined, PIOINT2_IRQHandler will be declared and
                        handled in core/gpio/gpio.c
    GPIO_ENABLE_IRQ3    If defined, PIOINT3_IRQHandler will be declared and
                        handled in core/gpio/gpio.c

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

    #ifdef CFG_BRD_LPC1343_CATNIP
      // #define GPIO_ENABLE_IRQ0
      #define GPIO_ENABLE_IRQ1
      // #define GPIO_ENABLE_IRQ2
      // #define GPIO_ENABLE_IRQ3
    #endif

/*=========================================================================*/


/*=========================================================================
    ALTERNATE RESET PIN
    -----------------------------------------------------------------------

    CFG_ALTRESET        If defined, indicates that a GPIO pin should be
                        configured as an alternate reset pin in addition
                        to the dedicated reset pin.
    CFG_ALTRESET_PORT   The GPIO port where the alt reset pin is located
    CFG_ALTRESET_PIN    The GPIO pin where the alt reset pin is located

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define CFG_ALTRESET
      #define CFG_ALTRESET_PORT         (1)
      #define CFG_ALTRESET_PIN          (5)   // P1.5 = RTS
    #endif
/*=========================================================================*/


/*=========================================================================
    UART
    -----------------------------------------------------------------------

    CFG_UART_BAUDRATE         The default UART speed.  This value is used 
                              when initialising UART, and should be a 
                              standard value like 57600, 9600, etc.  
                              NOTE: This value may be overridden if
                              another value is stored in EEPROM!
    CFG_UART_BUFSIZE          The length in bytes of the UART RX FIFO. This
                              will determine the maximum number of received
                              characters to store in memory.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

