microbuilder/LPC1343CodeBase/projectconfig.h
    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define CFG_UART_BAUDRATE           (57600)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_CATNIP
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

/*=========================================================================*/


/*=========================================================================
    SSP
    -----------------------------------------------------------------------

    CFG_SSP0_SCKPIN_2_11      Indicates which pin should be used for SCK0
    CFG_SSP0_SCKPIN_0_6
    CFG_SSP0_SCKPIN_0_10

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #if defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB || defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      // #define CFG_SSP0_SCKPIN_2_11
      #define CFG_SSP0_SCKPIN_0_6
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_CATNIP
        #define CFG_SSP0_SCKPIN_0_10
    #endif


/*=========================================================================*/


/*=========================================================================
    ADC
    -----------------------------------------------------------------------

    ADC_AVERAGING_ENABLE      To get better results, the ADC code can take
                              a number of samples and return the average
                              value.  This is slower, but can give more
                              accurate results compared to single-reading.
                              
                              To enable averaging, set ADC_AVERAGING_ENABLE
                              to a non-zero value.
    ADC_AVERAGING_SAMPLES     The number of ADC samples to read and
                              average if ADC averaging is enabled.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define ADC_AVERAGING_ENABLE    (1)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif

    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      #define ADC_AVERAGING_ENABLE    (1)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif

    #if defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB || defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define ADC_AVERAGING_ENABLE    (0)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define ADC_AVERAGING_ENABLE    (0)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      #define ADC_AVERAGING_ENABLE    (0)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      #define ADC_AVERAGING_ENABLE    (0)
      #define ADC_AVERAGING_SAMPLES   (5)
    #endif
    
    #ifdef CFG_BRD_LPC1343_CATNIP
        #define ADC_AVERAGING_ENABLE    (0)
        #define ADC_AVERAGING_SAMPLES   (5)
    #endif

/*=========================================================================*/


/*=========================================================================
    ON-BOARD LED
    -----------------------------------------------------------------------

    CFG_LED_PORT              The port for the on board LED
    CFG_LED_PIN               The pin for the on board LED
    CFG_LED_ON                The pin state to turn the LED on (0 = low, 1 = high)
    CFG_LED_OFF               The pin state to turn the LED off (0 = low, 1 = high)

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #if defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB || defined CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_LED_PORT                (3)
      #define CFG_LED_PIN                 (2)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      #define CFG_LED_PORT                (3)
      #define CFG_LED_PIN                 (2)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      #define CFG_LED_PORT                (0)
      #define CFG_LED_PIN                 (7)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_CATNIP
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

