microbuilder/LPC1343CodeBase/projectconfig.h
    #ifdef CFG_BRD_LPC1343_REFDESIGN_MINIMAL
      // #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "LPC1343 >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_USB
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "CMD >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_SHORTERRORS_UNKNOWNCOMMAND    "?"
      #define CFG_INTERFACE_SHORTERRORS_TOOMANYARGS       ">"
      #define CFG_INTERFACE_SHORTERRORS_TOOFEWARGS        "<"
      #define CFG_INTERFACE_CONFIRMREADY_TEXT             "."
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE_UART
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        ">>"
      #define CFG_INTERFACE_SILENTMODE    (1)
      #define CFG_INTERFACE_DROPCR        (1)
      #define CFG_INTERFACE_ENABLEIRQ     (1)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (1)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_SHORTERRORS_UNKNOWNCOMMAND    "?"
      #define CFG_INTERFACE_SHORTERRORS_TOOMANYARGS       ">"
      #define CFG_INTERFACE_SHORTERRORS_TOOFEWARGS        "<"
      #define CFG_INTERFACE_CONFIRMREADY_TEXT             "."
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      // #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "CMD >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif
	
    #ifdef CFG_BRD_LPC1343_OLIMEX_P
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "LPC-P1343 >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

    #ifdef CFG_BRD_LPC1343_LPCXPRESSO
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "LPC-P1343 >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

    #ifdef CFG_BRD_LPC1343_CATNIP
      #define CFG_INTERFACE
      #define CFG_INTERFACE_MAXMSGSIZE    (256)
      #define CFG_INTERFACE_PROMPT        "CatNip >> "
      #define CFG_INTERFACE_SILENTMODE    (0)
      #define CFG_INTERFACE_DROPCR        (0)
      #define CFG_INTERFACE_ENABLEIRQ     (0)
      #define CFG_INTERFACE_IRQPORT       (0)
      #define CFG_INTERFACE_IRQPIN        (7)
      #define CFG_INTERFACE_SHORTERRORS   (0)
      #define CFG_INTERFACE_CONFIRMREADY  (0)
      #define CFG_INTERFACE_LONGSYSINFO   (0)
    #endif

/*=========================================================================*/


/*=========================================================================
    PWM SETTINGS
    -----------------------------------------------------------------------

    CFG_PWM                     If this is defined, a basic PWM driver
                                will be included using 16-bit Timer 1 and
                                Pin 1.9 (MAT0) for the PWM output.  In
                                order to allow for a fixed number of
                                pulses to be generated, some PWM-specific
                                code is required in the 16-Bit Timer 1
                                ISR.  See "core/timer16/timer16.c" for
                                more information.
    CFG_PWM_DEFAULT_PULSEWIDTH  The default pulse width in ticks
    CFG_PWM_DEFAULT_DUTYCYCLE   The default duty cycle in percent

    DEPENDENCIES:               PWM output requires the use of 16-bit
                                timer 1 and pin 1.9 (CT16B1_MAT0).
    -----------------------------------------------------------------------*/
    // #define CFG_PWM
    #define CFG_PWM_DEFAULT_PULSEWIDTH  (CFG_CPU_CCLK / 1000)
    #define CFG_PWM_DEFAULT_DUTYCYCLE   (50)
    #ifdef CFG_BRD_LPC1343_CATNIP
      #define CFG_PWM
    #endif
/*=========================================================================*/


/*=========================================================================
    STEPPER MOTOR SETTINGS
    -----------------------------------------------------------------------

    CFG_STEPPER                 If this is defined, a simple bi-polar 
                                stepper motor will be included for common
                                H-bridge chips like the L293D or SN754410N

    DEPENDENCIES:               STEPPER requires the use of pins 3.0-3 and
                                32-bit Timer 0.
    -----------------------------------------------------------------------*/
    // #define CFG_STEPPER
/*=========================================================================*/


/*=========================================================================
    EEPROM
    -----------------------------------------------------------------------

    CFG_I2CEEPROM             If defined, drivers for the onboard EEPROM
                              will be included during build
    CFG_I2CEEPROM_SIZE        The number of bytes available on the EEPROM

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_I2CEEPROM
      #define CFG_I2CEEPROM_SIZE          (3072)
    #endif

